---
kind: other
id: Methods.T:Autodesk.Revit.DB.ModelTextType
source: html/e80e108f-91e6-16be-dc20-3fa530483f0e.htm
---
# ModelTextType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.